KCX-Mapping-Convert/testdaten/Export/KEX/06112011d.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
<ns2:submitToKcxRequest xmlns:ns2="http://www.kewill.com/schema/kids">
<shipment>
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;Header&gt;&lt;ns2:Header xmlns:ns2="http://www.eBiz.com/schemas/header/200310/ "&gt;&lt;SentAt&gt;&lt;Date&gt;&lt;Year&gt;2012&lt;/Year&gt;&lt;Month&gt;1&lt;/Month&gt;&lt;Day&gt;6&lt;/Day&gt;&lt;/Date&gt;&lt;Time&gt;2012-01-06 12:01:842&lt;/Time&gt;&lt;/SentAt&gt;&lt;Transmitter&gt;DE.KEX.TST&lt;/Transmitter&gt;&lt;Receiver&gt;DE.KEX.TST&lt;/Receiver&gt;&lt;Method&gt;EXS&lt;/Method&gt;&lt;MessageTP&gt;&lt;CountryCode&gt;GB&lt;/CountryCode&gt;&lt;Procedure&gt;EXPORT&lt;/Procedure&gt;&lt;MessageName&gt;ExportDeclaration&lt;/MessageName&gt;&lt;Release&gt;1.0.00&lt;/Release&gt;&lt;Direction&gt;FROM_CUSTOMER&lt;/Direction&gt;&lt;/MessageTP&gt;&lt;MessageID&gt;06112011D20120106-1209&lt;/MessageID&gt;&lt;/ns2:Header&gt;&lt;ns2:shheader xmlns:ns2="http://www.kewill.com/schema/shipment1"&gt;&lt;shdeclarations&gt;&lt;declarationUnid&gt;84664&lt;/declarationUnid&gt;&lt;declarationtype&gt;INVOICE&lt;/declarationtype&gt;&lt;declarationcode&gt;Origin&lt;/declarationcode&gt;&lt;declarationtext&gt;WE HEREBY CERTIFY THAT THE GOODS ENUMERATED ON THIS INVOICE ARE OF UNITED KINGDOM ORIGIN AND MANUFACTURE. MANUFACTURED BY KEWILL PLC, BRAMLEY HOUSE, GUILDFORD, GU3 1LR.
WE ALSO CERTIFY THAT THIS INVOICE IS TRUE AND CORRECT AND MATERIALS ARE IN ACCORDANCE WITH OUR RECORDED SPECIFICATIONS.
FOR KEWILL PLC

SIGNATORY&lt;/declarationtext&gt;&lt;/shdeclarations&gt;&lt;shdeclarations&gt;&lt;declarationUnid&gt;84665&lt;/declarationUnid&gt;&lt;declarationtype&gt;PACKING&lt;/declarationtype&gt;&lt;declarationcode&gt;Pack1&lt;/declarationcode&gt;&lt;declarationtext&gt;WE CERTIFY THAT THE PACKING MATERIALS ARE FREE FROM BARK AND UNTREATED WOOD.
FOR KEWIL PLC

SIGNATORY&lt;/declarationtext&gt;&lt;/shdeclarations&gt;&lt;shsignatures&gt;&lt;signatureUnid&gt;84666&lt;/signatureUnid&gt;&lt;signatorytype&gt;INVOICE&lt;/signatorytype&gt;&lt;signatorycode&gt;SJH&lt;/signatorycode&gt;&lt;signaturecompanyname&gt;KEWILL PLC&lt;/signaturecompanyname&gt;&lt;signatoryname&gt;S.J. HOWSON&lt;/signatoryname&gt;&lt;signatoryplaceofissue&gt;GUILDFORD&lt;/signatoryplaceofissue&gt;&lt;signatoryphoneno&gt;+44 1483 406000&lt;/signatoryphoneno&gt;&lt;signatoryfaxno&gt;+44 1483 406001&lt;/signatoryfaxno&gt;&lt;signatoryemailid&gt;steve.howson@kewill.com&lt;/signatoryemailid&gt;&lt;signatorytitleposition&gt;CHIEF ADMINISTRATOR&lt;/signatorytitleposition&gt;&lt;/shsignatures&gt;&lt;shtermses&gt;&lt;termsUnid&gt;84668&lt;/termsUnid&gt;&lt;termtypecode&gt;PAYMENT&lt;/termtypecode&gt;&lt;termcode&gt;30&lt;/termcode&gt;&lt;termtext&gt;30 days&lt;/termtext&gt;&lt;/shtermses&gt;&lt;shtermses&gt;&lt;termsUnid&gt;84669&lt;/termsUnid&gt;&lt;termtypecode&gt;DELIVERY&lt;/termtypecode&gt;&lt;termcode&gt;CFR&lt;/termcode&gt;&lt;termtext&gt;CFR SINGAPORE&lt;/termtext&gt;&lt;deliverytermincoterm&gt;CFR&lt;/deliverytermincoterm&gt;&lt;deliverytermintrastat&gt;CFR&lt;/deliverytermintrastat&gt;&lt;/shtermses&gt;&lt;shintrastats&gt;&lt;unid&gt;84681&lt;/unid&gt;&lt;/shintrastats&gt;&lt;shuscustoms&gt;&lt;uscustomsUnid&gt;84683&lt;/uscustomsUnid&gt;&lt;sedtransactrelatedyn&gt;false&lt;/sedtransactrelatedyn&gt;&lt;sedroutedyn&gt;false&lt;/sedroutedyn&gt;&lt;sedcontainerizedyn&gt;false&lt;/sedcontainerizedyn&gt;&lt;sedsoldenrouteyn&gt;false&lt;/sedsoldenrouteyn&gt;&lt;sedresponsereceived&gt;false&lt;/sedresponsereceived&gt;&lt;sedbgjobnohandsfree&gt;0&lt;/sedbgjobnohandsfree&gt;&lt;sedmixedflag&gt;false&lt;/sedmixedflag&gt;&lt;/shuscustoms&gt;&lt;sheucustoms&gt;&lt;eucustomsUnid&gt;84680&lt;/eucustomsUnid&gt;&lt;officeofdespatchsadboxa&gt;GB000051&lt;/officeofdespatchsadboxa&gt;&lt;saddeclarationdivision2&gt;D&lt;/saddeclarationdivision2&gt;&lt;euducr&gt;2GBGB6088818070-8&lt;/euducr&gt;&lt;transportidatbord&gt;SEAFREIGHT&lt;/transportidatbord&gt;&lt;declarationtype&gt;EFD&lt;/declarationtype&gt;&lt;methodofpayment&gt;Y&lt;/methodofpayment&gt;&lt;singletransportcontract&gt;true&lt;/singletransportcontract&gt;&lt;transportmotborder&gt;1&lt;/transportmotborder&gt;&lt;/sheucustoms&gt;&lt;shdocumentgrid&gt;&lt;unid&gt;84679&lt;/unid&gt;&lt;/shdocumentgrid&gt;&lt;shtaxes&gt;&lt;taxUnid&gt;84667&lt;/taxUnid&gt;&lt;totamntpertaxrate&gt;27500&lt;/totamntpertaxrate&gt;&lt;tottaxpertaxrate&gt;0&lt;/tottaxpertaxrate&gt;&lt;categoryoftax&gt;I&lt;/categoryoftax&gt;&lt;taxratecode&gt;0&lt;/taxratecode&gt;&lt;taxratepercent&gt;0&lt;/taxratepercent&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/shtaxes&gt;&lt;shbankcollect&gt;&lt;unid&gt;84678&lt;/unid&gt;&lt;/shbankcollect&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84660&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;EXPORTER&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;Kewill&lt;/addresscode&gt;&lt;shortname&gt;Kewill&lt;/shortname&gt;&lt;vattaxregistrationcode&gt;GB608881807&lt;/vattaxregistrationcode&gt;&lt;freeformataddress&gt;Kewill plc	
Bramley House	
The Guildway
Artington
Giuldford
GU3 1LR&lt;/freeformataddress&gt;&lt;eorino&gt;GB608881807&lt;/eorino&gt;&lt;eoribranch&gt;000&lt;/eoribranch&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84661&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;AGENTS&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;FWDR&lt;/addresscode&gt;&lt;shortname&gt;UKFWDER&lt;/shortname&gt;&lt;freeformataddress&gt;FORWARDERS INTERNATIONAL LTD, 5 PORT ROAD, TERMINAL TERRACE, SOUTHAMPTON, HANTS.&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84662&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;CONSIGNEE&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;Importers&lt;/addresscode&gt;&lt;shortname&gt;Importers&lt;/shortname&gt;&lt;freeformataddress&gt;IMPORTERS INCORPORATED INC
70 UBI CRESCENT
1-10 UBI TECHPARK
SINGAPORE&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shaddresses&gt;&lt;addressUnid&gt;84663&lt;/addressUnid&gt;&lt;shipmentaddresstypecode&gt;FORWARDER&lt;/shipmentaddresstypecode&gt;&lt;addresscode&gt;FWDR&lt;/addresscode&gt;&lt;shortname&gt;UKFWDER&lt;/shortname&gt;&lt;freeformataddress&gt;FORWARDERS INTERNATIONAL LTD, 5 PORT ROAD, TERMINAL TERRACE, SOUTHAMPTON, HANTS.&lt;/freeformataddress&gt;&lt;/shaddresses&gt;&lt;shsli&gt;&lt;deliverytermincoterm&gt;CFR&lt;/deliverytermincoterm&gt;&lt;unid&gt;84682&lt;/unid&gt;&lt;/shsli&gt;&lt;shpackages&gt;&lt;unid&gt;84712&lt;/unid&gt;&lt;packageid&gt;Box&lt;/packageid&gt;&lt;sipackeditem&gt;&lt;unid&gt;84713&lt;/unid&gt;&lt;commercialitemUnid&gt;84671&lt;/commercialitemUnid&gt;&lt;description&gt;EXPORT PRODUCT  12X24 UNITS&lt;/description&gt;&lt;lineno&gt;1&lt;/lineno&gt;&lt;productcode&gt;PROD123&lt;/productcode&gt;&lt;quantitypacked&gt;1500&lt;/quantitypacked&gt;&lt;quantityuom&gt;1&lt;/quantityuom&gt;&lt;/sipackeditem&gt;&lt;sipackeditem&gt;&lt;unid&gt;84714&lt;/unid&gt;&lt;commercialitemUnid&gt;84670&lt;/commercialitemUnid&gt;&lt;description&gt;EXPORT PRODUCT  12X24 UNITS&lt;/description&gt;&lt;lineno&gt;2&lt;/lineno&gt;&lt;productcode&gt;PROD123&lt;/productcode&gt;&lt;quantitypacked&gt;250&lt;/quantitypacked&gt;&lt;quantityuom&gt;1&lt;/quantityuom&gt;&lt;/sipackeditem&gt;&lt;grossweight&gt;1750&lt;/grossweight&gt;&lt;overpack&gt;false&lt;/overpack&gt;&lt;/shpackages&gt;&lt;sicommercialitems&gt;&lt;commercialitemUnid&gt;84671&lt;/commercialitemUnid&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;commercialitemSno&gt;1&lt;/commercialitemSno&gt;&lt;deleteflag&gt;false&lt;/deleteflag&gt;&lt;productcodesku&gt;PROD123&lt;/productcodesku&gt;&lt;descriptioninvoiceline&gt;EXPORT PRODUCT  12X24 UNITS&lt;/descriptioninvoiceline&gt;&lt;quantityconversionsign&gt;*&lt;/quantityconversionsign&gt;&lt;quantityconversionfactor&gt;1&lt;/quantityconversionfactor&gt;&lt;quantityinvoiceline&gt;1500&lt;/quantityinvoiceline&gt;&lt;quantityuom&gt;1&lt;/quantityuom&gt;&lt;unitpriceinvoiceline&gt;15&lt;/unitpriceinvoiceline&gt;&lt;unitpriceuom&gt;EACH&lt;/unitpriceuom&gt;&lt;totalpriceforline&gt;22500&lt;/totalpriceforline&gt;&lt;grossweightinvoiceline&gt;2000&lt;/grossweightinvoiceline&gt;&lt;netweightinvoiceline&gt;1500&lt;/netweightinvoiceline&gt;&lt;noofpackagesfrominvoiceline&gt;0&lt;/noofpackagesfrominvoiceline&gt;&lt;palletnumberfrominvoiceline&gt;1&lt;/palletnumberfrominvoiceline&gt;&lt;palletnumbertoinvoicelist&gt;1&lt;/palletnumbertoinvoicelist&gt;&lt;uomnetweightper&gt;1&lt;/uomnetweightper&gt;&lt;natureoftransivl&gt;10&lt;/natureoftransivl&gt;&lt;taxratecodeforinvoiceivl&gt;0&lt;/taxratecodeforinvoiceivl&gt;&lt;taxrateercent&gt;0&lt;/taxrateercent&gt;&lt;commoditycodeinvoice&gt;85086000&lt;/commoditycodeinvoice&gt;&lt;customsregimeivl&gt;1000001&lt;/customsregimeivl&gt;&lt;licenceexceptionflag&gt;0&lt;/licenceexceptionflag&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/sicommercialitems&gt;&lt;sicommercialitems&gt;&lt;commercialitemUnid&gt;84670&lt;/commercialitemUnid&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;commercialitemSno&gt;2&lt;/commercialitemSno&gt;&lt;deleteflag&gt;false&lt;/deleteflag&gt;&lt;productcodesku&gt;PROD123&lt;/productcodesku&gt;&lt;descriptioninvoiceline&gt;EXPORT PRODUCT  12X24 UNITS&lt;/descriptioninvoiceline&gt;&lt;quantityconversionsign&gt;*&lt;/quantityconversionsign&gt;&lt;quantityconversionfactor&gt;1&lt;/quantityconversionfactor&gt;&lt;quantityinvoiceline&gt;250&lt;/quantityinvoiceline&gt;&lt;quantityuom&gt;1&lt;/quantityuom&gt;&lt;unitpriceinvoiceline&gt;20&lt;/unitpriceinvoiceline&gt;&lt;unitpriceuom&gt;EACH&lt;/unitpriceuom&gt;&lt;totalpriceforline&gt;5000&lt;/totalpriceforline&gt;&lt;grossweightinvoiceline&gt;300&lt;/grossweightinvoiceline&gt;&lt;netweightinvoiceline&gt;250&lt;/netweightinvoiceline&gt;&lt;noofpackagesfrominvoiceline&gt;0&lt;/noofpackagesfrominvoiceline&gt;&lt;uomnetweightper&gt;1&lt;/uomnetweightper&gt;&lt;natureoftransivl&gt;10&lt;/natureoftransivl&gt;&lt;taxratecodeforinvoiceivl&gt;0&lt;/taxratecodeforinvoiceivl&gt;&lt;taxrateercent&gt;0&lt;/taxrateercent&gt;&lt;commoditycodeinvoice&gt;48176000&lt;/commoditycodeinvoice&gt;&lt;customsregimeivl&gt;1000001&lt;/customsregimeivl&gt;&lt;licenceexceptionflag&gt;0&lt;/licenceexceptionflag&gt;&lt;currencycode&gt;GBP&lt;/currencycode&gt;&lt;/sicommercialitems&gt;&lt;sicustomitems&gt;&lt;sicustomsdocs&gt;&lt;sidocumentUnid&gt;84673&lt;/sidocumentUnid&gt;&lt;prevdoctype&gt;380&lt;/prevdoctype&gt;&lt;prevdocref&gt;23434532&lt;/prevdocref&gt;&lt;prevdocclass&gt;Z&lt;/prevdocclass&gt;&lt;/sicustomsdocs&gt;&lt;customitemUnid&gt;84672&lt;/customitemUnid&gt;&lt;sicustomsmessage/&gt;&lt;originatinginvoicelinenumber&gt;10&lt;/originatinginvoicelinenumber&gt;&lt;noofpackagesfromcustoms&gt;0&lt;/noofpackagesfromcustoms&gt;&lt;kindofpackagescodecustoms&gt;PT&lt;/kindofpackagescodecustoms&gt;&lt;descriptionofgoodscustoms&gt;EXPORT PRODUCT  12X24 UNITS&lt;/descriptionofgoodscustoms&gt;&lt;commoditycode&gt;48176000&lt;/commoditycode&gt;&lt;grossweightcustoms&gt;300&lt;/grossweightcustoms&gt;&lt;netweightcustoms&gt;250&lt;/netweightcustoms&gt;&lt;legalweightcustomsitem&gt;0&lt;/legalweightcustomsitem&gt;&lt;volumecustomsitem&gt;0&lt;/volumecustomsitem&gt;&lt;customscurrency&gt;GBP&lt;/customscurrency&gt;&lt;statisticsvaluecustomsitem&gt;5000&lt;/statisticsvaluecustomsitem&gt;&lt;fiscalvaluecustomsitem&gt;0&lt;/fiscalvaluecustomsitem&gt;&lt;customsregimecus&gt;1000001&lt;/customsregimecus&gt;&lt;supplementaryunitscustomsq2&gt;0&lt;/supplementaryunitscustomsq2&gt;&lt;quantity3&gt;0&lt;/quantity3&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;transactioncodenot&gt;10&lt;/transactioncodenot&gt;&lt;sedlicenseexemptionindicator&gt;0&lt;/sedlicenseexemptionindicator&gt;&lt;/sicustomitems&gt;&lt;sicustomitems&gt;&lt;sicustomsdocs&gt;&lt;sidocumentUnid&gt;84676&lt;/sidocumentUnid&gt;&lt;prevdoctype&gt;380&lt;/prevdoctype&gt;&lt;prevdocref&gt;5ER455443&lt;/prevdocref&gt;&lt;prevdocclass&gt;Z&lt;/prevdocclass&gt;&lt;/sicustomsdocs&gt;&lt;customitemUnid&gt;84675&lt;/customitemUnid&gt;&lt;sicustomsmessage/&gt;&lt;originatinginvoicelinenumber&gt;20&lt;/originatinginvoicelinenumber&gt;&lt;noofpackagesfromcustoms&gt;0&lt;/noofpackagesfromcustoms&gt;&lt;kindofpackagescodecustoms&gt;PT&lt;/kindofpackagescodecustoms&gt;&lt;marksnoscustoms&gt;FULLY ADDRESSED&lt;/marksnoscustoms&gt;&lt;descriptionofgoodscustoms&gt;EXPORT PRODUCT  12X24 UNITS&lt;/descriptionofgoodscustoms&gt;&lt;commoditycode&gt;85086000&lt;/commoditycode&gt;&lt;grossweightcustoms&gt;2000&lt;/grossweightcustoms&gt;&lt;netweightcustoms&gt;1500&lt;/netweightcustoms&gt;&lt;legalweightcustomsitem&gt;0&lt;/legalweightcustomsitem&gt;&lt;volumecustomsitem&gt;0&lt;/volumecustomsitem&gt;&lt;customscurrency&gt;GBP&lt;/customscurrency&gt;&lt;statisticsvaluecustomsitem&gt;22500&lt;/statisticsvaluecustomsitem&gt;&lt;fiscalvaluecustomsitem&gt;0&lt;/fiscalvaluecustomsitem&gt;&lt;customsregimecus&gt;100001&lt;/customsregimecus&gt;&lt;supplementaryunitscustomsq2&gt;0&lt;/supplementaryunitscustomsq2&gt;&lt;quantity3&gt;0&lt;/quantity3&gt;&lt;countryoforigincode&gt;GB&lt;/countryoforigincode&gt;&lt;transactioncodenot&gt;10&lt;/transactioncodenot&gt;&lt;sedlicenseexemptionindicator&gt;0&lt;/sedlicenseexemptionindicator&gt;&lt;/sicustomitems&gt;&lt;shpackingconfig&gt;&lt;unid&gt;84715&lt;/unid&gt;&lt;packbysernum&gt;true&lt;/packbysernum&gt;&lt;packbylotnum&gt;true&lt;/packbylotnum&gt;&lt;rulelevel&gt;None&lt;/rulelevel&gt;&lt;/shpackingconfig&gt;&lt;unid&gt;84659&lt;/unid&gt;&lt;ownerid&gt;testGroup&lt;/ownerid&gt;&lt;transactionref&gt;06112011d&lt;/transactionref&gt;&lt;orderdate&gt;2011-12-12T00:00:00Z&lt;/orderdate&gt;&lt;createdate&gt;2011-12-12T12:52:45Z&lt;/createdate&gt;&lt;despatchdate&gt;2011-12-14T00:00:00Z&lt;/despatchdate&gt;&lt;customerporef&gt;PO34323&lt;/customerporef&gt;&lt;exporterref&gt;06112011&lt;/exporterref&gt;&lt;invoicenumber&gt;123453240&lt;/invoicenumber&gt;&lt;salesordernumber&gt;234DG54545&lt;/salesordernumber&gt;&lt;portofloading&gt;FELIXSTOWE&lt;/portofloading&gt;&lt;portofloadingcode&gt;FXT&lt;/portofloadingcode&gt;&lt;portofdischarge&gt;SINGAPORE&lt;/portofdischarge&gt;&lt;portofdischargecode&gt;SCT&lt;/portofdischargecode&gt;&lt;placeofdelivery&gt;SINGAPORE&lt;/placeofdelivery&gt;&lt;placeofdeliverycode&gt;SIN&lt;/placeofdeliverycode&gt;&lt;countryofdespatch&gt;UNITED KINGDOM&lt;/countryofdespatch&gt;&lt;countryofdespatchcode&gt;GB&lt;/countryofdespatchcode&gt;&lt;containerprefix&gt;CTIU&lt;/containerprefix&gt;&lt;containernumber&gt;12343332&lt;/containernumber&gt;&lt;sealnumber1&gt;12ER5587&lt;/sealnumber1&gt;&lt;totnoofpackagesheader&gt;0&lt;/totnoofpackagesheader&gt;&lt;descofgoodsheader&gt;DOMESTIC APPLIANCES&lt;/descofgoodsheader&gt;&lt;weightunitindicatorkglb&gt;KG&lt;/weightunitindicatorkglb&gt;&lt;deleteflag&gt;false&lt;/deleteflag&gt;&lt;totnoivl&gt;2&lt;/totnoivl&gt;&lt;totnocus&gt;2&lt;/totnocus&gt;&lt;totalgrossweightinvoice&gt;2300&lt;/totalgrossweightinvoice&gt;&lt;totalnetweightinvoice&gt;1750&lt;/totalnetweightinvoice&gt;&lt;totalgrossweightcustoms&gt;2300&lt;/totalgrossweightcustoms&gt;&lt;totalnetweightcustoms&gt;1750&lt;/totalnetweightcustoms&gt;&lt;totalgrossweightpacking&gt;1750&lt;/totalgrossweightpacking&gt;&lt;invinvoicelinestotal&gt;27500&lt;/invinvoicelinestotal&gt;&lt;invinvoiceamounttotal&gt;27500&lt;/invinvoiceamounttotal&gt;&lt;headercurrency&gt;GBP&lt;/headercurrency&gt;&lt;motcode&gt;1&lt;/motcode&gt;&lt;containersize&gt;20ft general&lt;/containersize&gt;&lt;/ns2:shheader&gt;&lt;/Header&gt;
</shipment>
</ns2:submitToKcxRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>